Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/library.tmx
Source language: en
Languages: pt

source: 2to3 - Automated Python 2 to 3 code translation
pt: 2to3 - Conversão automatizada de código Python 2 para 3

source: 2to3 is a Python program that reads Python 2.x source code and applies a series of *fixers* to transform it into valid Python 3.x code. The standard library contains a rich set of fixers that will handle almost all code. 2to3 supporting library :mod:`lib2to3` is, however, a flexible and generic library, so it is possible to write your own fixers for 2to3. :mod:`lib2to3` could also be adapted to custom applications in which Python code needs to be edited automatically.
pt: 2to3 é um programa que lê código fonte Python 2.x e aplica uma série de *fixers* para transformá-lo em código Python 3.x válido. A biblioteca padrão contém um rico conjunto de fixers que irão lidar com quase todo o código. A biblioteca :mod:`lib2to3`de suporte ao 2to3 é, no entanto, uma biblioteca flexível e genérica, por isso, é possível escrever seus próprios fixers para 2to3. :mod:`lib2to3` também pode ser adaptada para aplicações personalizadas nas quais o código Python precisa ser editado automaticamente.

source: Using 2to3
pt: Usando 2to3

source: 2to3 will usually be installed with the Python interpreter as a script. It is also located in the :file:`Tools/scripts` directory of the Python root.
pt: 2to3 é normalmente instalada como um script, juntamente com o interpretador Python. Ela também pode ser encontrada no diretório :file:`Tools/scripts`, a partir do diretório raiz do Python.

source: 2to3's basic arguments are a list of files or directories to transform. The directories are to recursively traversed for Python sources.
pt: Os argumentos básicos de 2to3 são uma lista dos arquivos ou diretórios que deverão ser convertidos. Os diretórios serão recursivamente analisados por arquivos-fonte Python.

source: Here is a sample Python 2.x source file, :file:`example.py`::
pt: Aqui está um exemplo de código fonte Python 2.x, :file:`exemplo.py`::

source: def greet(name): print "Hello, {0}!".format(name) print "What's your name?" name = raw_input() greet(name)
pt: def cumprimentar(nome): print "Olá, {0}!".format(nome) print "Qual é o seu nome?" name = raw_input() cumprimentar(nome)

source: It can be converted to Python 3.x code via 2to3 on the command line::
pt: Isto pode ser convertido para código Python 3.x via 2to3 pela linha de comando::

source: $ 2to3 example.py
pt: $ 2to3 exemplo.py

source: $ 2to3 -w example.py
pt: $ 2to3 -w exemplo.py

source: Comments and exact indentation are preserved throughout the translation process.
pt: Comentários e indentações são preservados durante o processo de tradução.

source: is changed to ::
pt: mudou para:

source: See also
pt: Veja também

source: Return the number of audio channels (1 for mono, 2 for stereo).
pt: Retorna o número dos canais de áudio (1 para mono, 2 para stereo).

source: Return the size in bytes of individual samples.
pt: Retorna o tamanho em bytes de amostras individuais.

source: Return the sampling rate (number of audio frames per second).
pt: Retorna a taxa de amostragem (número de frames de áudio por segundo).

source: Return the number of audio frames in the file.
pt: Retorna o número de frames de áudio no arquivo.

source: description
pt: descrição

source: Must be zero.
pt: Precisa ser zero.
